[
    {
        "Review_Date": "12/05/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "No damages...worth for readers",
        "Review_Body": "Really good product.. worthy"
    },
    {
        "Review_Date": "09/05/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "Wonderful book",
        "Review_Body": "It's a must read and engages the reader completely in its story. One can relate to the situations author has mentioned in the book"
    },
    {
        "Review_Date": "19/04/2025",
        "User_Rating_out_of_5": "4.0",
        "Review_Title": "Good",
        "Review_Body": "Story of events a lot of college students would have gone through during and post covid of studying, living away from home. If you belong from Banaglore you'll be able to relate to the book a little more. Small chapters which keep you hooked and look forward to read more."
    },
    {
        "Review_Date": "28/04/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "Outstanding",
        "Review_Body": "Best one in my collection\nMust read this. ❤️"
    },
    {
        "Review_Date": "24/05/2025",
        "User_Rating_out_of_5": "1.0",
        "Review_Title": "I didn't satisfied in this product",
        "Review_Body": "I don't want this product I put return so many days i didn't get amount in my account in this product please solve this issue"
    },
    {
        "Review_Date": "06/02/2025",
        "User_Rating_out_of_5": "3.0",
        "Review_Title": "Good read.",
        "Review_Body": "It was a good read, however many of the qoutes and lines seem not to be original and copied from internet."
    },
    {
        "Review_Date": "15/04/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "Excellent",
        "Review_Body": "Just started reading the book\ncompleted 25 pages\nI loved it the way author wrote is awesome"
    },
    {
        "Review_Date": "13/04/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "Can we be strangers again",
        "Review_Body": "Go for it"
    },
    {
        "Review_Date": "28/01/2025",
        "User_Rating_out_of_5": "4.0",
        "Review_Title": "Felt like a roller-coaster ride",
        "Review_Body": "Thank you Shrijeet It was an roller-coaster ride for me the story very nice but I felt little sleepy because of the Hindi sentences in mid of every chapter I can't really understand those words but deepdown I catches the emotions and it was a triangle love story which ended up with bitterness but it was claming... I giving 4 start coz I can't able to understand those Hindi words"
    },
    {
        "Review_Date": "31/03/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "Good",
        "Review_Body": "Just as expected. Received without any damages or tamper."
    },
    {
        "Review_Date": "04/02/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "I just don’t wanted to end this story😭",
        "Review_Body": "I just don’t wanted to end this story 😭, as I writer I liked it and to be honest I never read a novel full any novel I won’t read full but this one is different I read full and I wanted to read even more\n\nI’m waiting for your next book 📕"
    },
    {
        "Review_Date": "28/01/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "Its Mine First Book",
        "Review_Body": "It's my first book. I love it.\n\nI will never forget the story of this book two ways as it was a heart touching book and i have started journey reading books from this book only."
    },
    {
        "Review_Date": "25/01/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "a must read for hopeless romantics",
        "Review_Body": "Pretty good, Being still the hopeless romantic at the end of the story, just woww. It’s always the no ending story’s."
    },
    {
        "Review_Date": "28/01/2025",
        "User_Rating_out_of_5": "2.0",
        "Review_Title": "Boring from 2nd half.",
        "Review_Body": "First half was OK, but second half of the story was deliberately stretched for no reason. Was expecting a nice ending."
    },
    {
        "Review_Date": "31/01/2025",
        "User_Rating_out_of_5": "1.0",
        "Review_Title": "only for Noobs!",
        "Review_Body": "The book tries to speak alot but is unable to express literally ANYTHING, Waste of time for real adults tbh!"
    },
    {
        "Review_Date": "02/05/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "Must read",
        "Review_Body": "Please read this book. I found it lovely to read this book. Easy english also, can be easily read by anyone."
    },
    {
        "Review_Date": "25/03/2025",
        "User_Rating_out_of_5": "5.0",
        "Review_Title": "Great book",
        "Review_Body": "A must read! Enjoyed every bit of it. The story carefully captures the character's emotions and is very well written."
    },
    {
        "Review_Date": "22/04/2025",
        "User_Rating_out_of_5": "1.0",
        "Review_Title": "Stay away from this book, as far away as possible!",
        "Review_Body": "Some books leave a lasting impression. Others, unfortunately, leave you wondering why you started them at all. This book falls firmly into the latter category.\n\nMarketed as a NATIONAL BESTSELLER, this book attempts to explore themes of love, betrayal, and emotional conflict between friends. However, what could have been a sensitive and nostalgic story turns into a frustrating, amateurish attempt at storytelling.\n\nThe biggest issue is the writing itself. The language is broken, unpolished, and full of grammatical errors. The author tries to sound profound but ends up being confused. Sentences often read like unfinished thoughts, and instead of drawing readers in, they push them away. What’s worse, there are long patches of dialogue in Hindi (likely meant to feel authentic) that instead come off as jarring and awkward, acting more like speed bumps than enhancing the story.\n\nThe characters, including the protagonist, Dev are paper-thin. Their motivations are unclear, their actions inconsistent, and their emotional arcs barely developed. We’re told there's a love triangle and emotional fallout, but it’s never truly felt. Their conversations are forced and lack any real emotional punch. As a reader, it’s hard to connect with any of them, let alone care about what happens to them.\n\nDev, the protagonist, is particularly difficult to empathise with. He comes across as confused and directionless, not just in the plot, but in voice. The supporting characters are equally vague. Instead of layered, conflicted individuals, we’re left with one-dimensional outlines that never come to life.\n\nThe pacing is sluggish, the structure loose, and the transitions between scenes clumsy. There’s no real narrative grip to hold the reader’s attention. Important emotional moments are either rushed or dragged out to the point of tedium. There's a lot of telling and very little showing. And when you finally expect something meaningful, you're hit with more awkward dialogue or a poorly written monologue.\n\nThe book doesn’t evoke emotion, instead it demands it, without earning it. The story tries hard to be deep and moving but ends up feeling superficial. The emotional beats are either underwhelming or melodramatic. Even the heartbreak, which should be the most poignant part, comes across as flat and unconvincing.\n\nIn all honesty, this book reads like an underdeveloped draft that needed much more work before being published. I am especially miffed with the team at Penguin who probably slept through the edits of this book. I wonder what the marketing team was high on when they labeled the book with the 'NATIONAL BESTSELLER' tag. (I really want to know who declared this book that!)\n\nDon't get me wrong, the story has potential with themes like lost love, broken friendships, the pain of growing up, but it is completely buried under poor execution and clunky writing.\n\nAs a reader who appreciates emotional, character-driven stories, this was a deeply disappointing experience. There is no shame in writing a debut novel, but there is a responsibility to respect the reader’s time and attention. Sadly, this book does neither.\n\nCan We Be Strangers Again is a missed opportunity, and possibly one of the weakest books I’ve ever read. Unless you're looking for a case study in what not to do when writing contemporary romance, you’re better off skipping this one."
    }
]